__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 256, 256, 50, 0                                            
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 256, 256, 50, 512         input_1[0][0]                    
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 256, 256, 50) 0           conv3d_1[0][0]                   
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 256, 256, 50) 0           conv3d_1[0][0]                   
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 256, 256, 50) 0           conv3d_1[0][0]                   
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 256, 256, 50) 0           conv3d_1[0][0]                   
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, 256, 256, 50) 0           conv3d_1[0][0]                   
__________________________________________________________________________________________________
lambda_6 (Lambda)               (None, 256, 256, 50) 0           conv3d_1[0][0]                   
__________________________________________________________________________________________________
lambda_7 (Lambda)               (None, 256, 256, 50) 0           conv3d_1[0][0]                   
__________________________________________________________________________________________________
lambda_8 (Lambda)               (None, 256, 256, 50) 0           conv3d_1[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 50)           0           lambda_1[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 50)           0           lambda_2[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_3 (Glo (None, 50)           0           lambda_3[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_4 (Glo (None, 50)           0           lambda_4[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_5 (Glo (None, 50)           0           lambda_5[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_6 (Glo (None, 50)           0           lambda_6[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_7 (Glo (None, 50)           0           lambda_7[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_8 (Glo (None, 50)           0           lambda_8[0][0]                   
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 12)           612         global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 12)           612         global_average_pooling2d_2[0][0] 
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 12)           612         global_average_pooling2d_3[0][0] 
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 12)           612         global_average_pooling2d_4[0][0] 
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 12)           612         global_average_pooling2d_5[0][0] 
__________________________________________________________________________________________________
dense_11 (Dense)                (None, 12)           612         global_average_pooling2d_6[0][0] 
__________________________________________________________________________________________________
dense_13 (Dense)                (None, 12)           612         global_average_pooling2d_7[0][0] 
__________________________________________________________________________________________________
dense_15 (Dense)                (None, 12)           612         global_average_pooling2d_8[0][0] 
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 50)           650         dense_1[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 50)           650         dense_3[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 50)           650         dense_5[0][0]                    
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 50)           650         dense_7[0][0]                    
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 50)           650         dense_9[0][0]                    
__________________________________________________________________________________________________
dense_12 (Dense)                (None, 50)           650         dense_11[0][0]                   
__________________________________________________________________________________________________
dense_14 (Dense)                (None, 50)           650         dense_13[0][0]                   
__________________________________________________________________________________________________
dense_16 (Dense)                (None, 50)           650         dense_15[0][0]                   
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, 256, 256, 50) 0           lambda_1[0][0]                   
                                                                 dense_2[0][0]                    
__________________________________________________________________________________________________
multiply_2 (Multiply)           (None, 256, 256, 50) 0           lambda_2[0][0]                   
                                                                 dense_4[0][0]                    
__________________________________________________________________________________________________
multiply_3 (Multiply)           (None, 256, 256, 50) 0           lambda_3[0][0]                   
                                                                 dense_6[0][0]                    
__________________________________________________________________________________________________
multiply_4 (Multiply)           (None, 256, 256, 50) 0           lambda_4[0][0]                   
                                                                 dense_8[0][0]                    
__________________________________________________________________________________________________
multiply_5 (Multiply)           (None, 256, 256, 50) 0           lambda_5[0][0]                   
                                                                 dense_10[0][0]                   
__________________________________________________________________________________________________
multiply_6 (Multiply)           (None, 256, 256, 50) 0           lambda_6[0][0]                   
                                                                 dense_12[0][0]                   
__________________________________________________________________________________________________
multiply_7 (Multiply)           (None, 256, 256, 50) 0           lambda_7[0][0]                   
                                                                 dense_14[0][0]                   
__________________________________________________________________________________________________
multiply_8 (Multiply)           (None, 256, 256, 50) 0           lambda_8[0][0]                   
                                                                 dense_16[0][0]                   
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 256, 256, 50, 0           multiply_1[0][0]                 
__________________________________________________________________________________________________
reshape_2 (Reshape)             (None, 256, 256, 50, 0           multiply_2[0][0]                 
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 256, 256, 50, 0           multiply_3[0][0]                 
__________________________________________________________________________________________________
reshape_4 (Reshape)             (None, 256, 256, 50, 0           multiply_4[0][0]                 
__________________________________________________________________________________________________
reshape_5 (Reshape)             (None, 256, 256, 50, 0           multiply_5[0][0]                 
__________________________________________________________________________________________________
reshape_6 (Reshape)             (None, 256, 256, 50, 0           multiply_6[0][0]                 
__________________________________________________________________________________________________
reshape_7 (Reshape)             (None, 256, 256, 50, 0           multiply_7[0][0]                 
__________________________________________________________________________________________________
reshape_8 (Reshape)             (None, 256, 256, 50, 0           multiply_8[0][0]                 
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 256, 256, 50, 0           reshape_1[0][0]                  
                                                                 reshape_2[0][0]                  
                                                                 reshape_3[0][0]                  
                                                                 reshape_4[0][0]                  
                                                                 reshape_5[0][0]                  
                                                                 reshape_6[0][0]                  
                                                                 reshape_7[0][0]                  
                                                                 reshape_8[0][0]                  
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 256, 256, 50, 4040        concatenate_1[0][0]              
__________________________________________________________________________________________________
lambda_9 (Lambda)               (None, 256, 256, 50) 0           conv3d_2[0][0]                   
__________________________________________________________________________________________________
lambda_10 (Lambda)              (None, 256, 256, 50) 0           conv3d_2[0][0]                   
__________________________________________________________________________________________________
lambda_11 (Lambda)              (None, 256, 256, 50) 0           conv3d_2[0][0]                   
__________________________________________________________________________________________________
lambda_12 (Lambda)              (None, 256, 256, 50) 0           conv3d_2[0][0]                   
__________________________________________________________________________________________________
lambda_13 (Lambda)              (None, 256, 256, 50) 0           conv3d_2[0][0]                   
__________________________________________________________________________________________________
lambda_14 (Lambda)              (None, 256, 256, 50) 0           conv3d_2[0][0]                   
__________________________________________________________________________________________________
lambda_15 (Lambda)              (None, 256, 256, 50) 0           conv3d_2[0][0]                   
__________________________________________________________________________________________________
lambda_16 (Lambda)              (None, 256, 256, 50) 0           conv3d_2[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_9 (Glo (None, 50)           0           lambda_9[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_10 (Gl (None, 50)           0           lambda_10[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_11 (Gl (None, 50)           0           lambda_11[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_12 (Gl (None, 50)           0           lambda_12[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_13 (Gl (None, 50)           0           lambda_13[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_14 (Gl (None, 50)           0           lambda_14[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_15 (Gl (None, 50)           0           lambda_15[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_16 (Gl (None, 50)           0           lambda_16[0][0]                  
__________________________________________________________________________________________________
dense_17 (Dense)                (None, 12)           612         global_average_pooling2d_9[0][0] 
__________________________________________________________________________________________________
dense_19 (Dense)                (None, 12)           612         global_average_pooling2d_10[0][0]
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 12)           612         global_average_pooling2d_11[0][0]
__________________________________________________________________________________________________
dense_23 (Dense)                (None, 12)           612         global_average_pooling2d_12[0][0]
__________________________________________________________________________________________________
dense_25 (Dense)                (None, 12)           612         global_average_pooling2d_13[0][0]
__________________________________________________________________________________________________
dense_27 (Dense)                (None, 12)           612         global_average_pooling2d_14[0][0]
__________________________________________________________________________________________________
dense_29 (Dense)                (None, 12)           612         global_average_pooling2d_15[0][0]
__________________________________________________________________________________________________
dense_31 (Dense)                (None, 12)           612         global_average_pooling2d_16[0][0]
__________________________________________________________________________________________________
dense_18 (Dense)                (None, 50)           650         dense_17[0][0]                   
__________________________________________________________________________________________________
dense_20 (Dense)                (None, 50)           650         dense_19[0][0]                   
__________________________________________________________________________________________________
dense_22 (Dense)                (None, 50)           650         dense_21[0][0]                   
__________________________________________________________________________________________________
dense_24 (Dense)                (None, 50)           650         dense_23[0][0]                   
__________________________________________________________________________________________________
dense_26 (Dense)                (None, 50)           650         dense_25[0][0]                   
__________________________________________________________________________________________________
dense_28 (Dense)                (None, 50)           650         dense_27[0][0]                   
__________________________________________________________________________________________________
dense_30 (Dense)                (None, 50)           650         dense_29[0][0]                   
__________________________________________________________________________________________________
dense_32 (Dense)                (None, 50)           650         dense_31[0][0]                   
__________________________________________________________________________________________________
multiply_9 (Multiply)           (None, 256, 256, 50) 0           lambda_9[0][0]                   
                                                                 dense_18[0][0]                   
__________________________________________________________________________________________________
multiply_10 (Multiply)          (None, 256, 256, 50) 0           lambda_10[0][0]                  
                                                                 dense_20[0][0]                   
__________________________________________________________________________________________________
multiply_11 (Multiply)          (None, 256, 256, 50) 0           lambda_11[0][0]                  
                                                                 dense_22[0][0]                   
__________________________________________________________________________________________________
multiply_12 (Multiply)          (None, 256, 256, 50) 0           lambda_12[0][0]                  
                                                                 dense_24[0][0]                   
__________________________________________________________________________________________________
multiply_13 (Multiply)          (None, 256, 256, 50) 0           lambda_13[0][0]                  
                                                                 dense_26[0][0]                   
__________________________________________________________________________________________________
multiply_14 (Multiply)          (None, 256, 256, 50) 0           lambda_14[0][0]                  
                                                                 dense_28[0][0]                   
__________________________________________________________________________________________________
multiply_15 (Multiply)          (None, 256, 256, 50) 0           lambda_15[0][0]                  
                                                                 dense_30[0][0]                   
__________________________________________________________________________________________________
multiply_16 (Multiply)          (None, 256, 256, 50) 0           lambda_16[0][0]                  
                                                                 dense_32[0][0]                   
__________________________________________________________________________________________________
reshape_9 (Reshape)             (None, 256, 256, 50, 0           multiply_9[0][0]                 
__________________________________________________________________________________________________
reshape_10 (Reshape)            (None, 256, 256, 50, 0           multiply_10[0][0]                
__________________________________________________________________________________________________
reshape_11 (Reshape)            (None, 256, 256, 50, 0           multiply_11[0][0]                
__________________________________________________________________________________________________
reshape_12 (Reshape)            (None, 256, 256, 50, 0           multiply_12[0][0]                
__________________________________________________________________________________________________
reshape_13 (Reshape)            (None, 256, 256, 50, 0           multiply_13[0][0]                
__________________________________________________________________________________________________
reshape_14 (Reshape)            (None, 256, 256, 50, 0           multiply_14[0][0]                
__________________________________________________________________________________________________
reshape_15 (Reshape)            (None, 256, 256, 50, 0           multiply_15[0][0]                
__________________________________________________________________________________________________
reshape_16 (Reshape)            (None, 256, 256, 50, 0           multiply_16[0][0]                
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 256, 256, 50, 0           reshape_9[0][0]                  
                                                                 reshape_10[0][0]                 
                                                                 reshape_11[0][0]                 
                                                                 reshape_12[0][0]                 
                                                                 reshape_13[0][0]                 
                                                                 reshape_14[0][0]                 
                                                                 reshape_15[0][0]                 
                                                                 reshape_16[0][0]                 
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 256, 256, 50, 0           concatenate_1[0][0]              
                                                                 concatenate_2[0][0]              
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 256, 256, 50, 8072        concatenate_3[0][0]              
__________________________________________________________________________________________________
lambda_17 (Lambda)              (None, 256, 256, 50) 0           conv3d_3[0][0]                   
__________________________________________________________________________________________________
lambda_18 (Lambda)              (None, 256, 256, 50) 0           conv3d_3[0][0]                   
__________________________________________________________________________________________________
lambda_19 (Lambda)              (None, 256, 256, 50) 0           conv3d_3[0][0]                   
__________________________________________________________________________________________________
lambda_20 (Lambda)              (None, 256, 256, 50) 0           conv3d_3[0][0]                   
__________________________________________________________________________________________________
lambda_21 (Lambda)              (None, 256, 256, 50) 0           conv3d_3[0][0]                   
__________________________________________________________________________________________________
lambda_22 (Lambda)              (None, 256, 256, 50) 0           conv3d_3[0][0]                   
__________________________________________________________________________________________________
lambda_23 (Lambda)              (None, 256, 256, 50) 0           conv3d_3[0][0]                   
__________________________________________________________________________________________________
lambda_24 (Lambda)              (None, 256, 256, 50) 0           conv3d_3[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_17 (Gl (None, 50)           0           lambda_17[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_18 (Gl (None, 50)           0           lambda_18[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_19 (Gl (None, 50)           0           lambda_19[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_20 (Gl (None, 50)           0           lambda_20[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_21 (Gl (None, 50)           0           lambda_21[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_22 (Gl (None, 50)           0           lambda_22[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_23 (Gl (None, 50)           0           lambda_23[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_24 (Gl (None, 50)           0           lambda_24[0][0]                  
__________________________________________________________________________________________________
dense_33 (Dense)                (None, 12)           612         global_average_pooling2d_17[0][0]
__________________________________________________________________________________________________
dense_35 (Dense)                (None, 12)           612         global_average_pooling2d_18[0][0]
__________________________________________________________________________________________________
dense_37 (Dense)                (None, 12)           612         global_average_pooling2d_19[0][0]
__________________________________________________________________________________________________
dense_39 (Dense)                (None, 12)           612         global_average_pooling2d_20[0][0]
__________________________________________________________________________________________________
dense_41 (Dense)                (None, 12)           612         global_average_pooling2d_21[0][0]
__________________________________________________________________________________________________
dense_43 (Dense)                (None, 12)           612         global_average_pooling2d_22[0][0]
__________________________________________________________________________________________________
dense_45 (Dense)                (None, 12)           612         global_average_pooling2d_23[0][0]
__________________________________________________________________________________________________
dense_47 (Dense)                (None, 12)           612         global_average_pooling2d_24[0][0]
__________________________________________________________________________________________________
dense_34 (Dense)                (None, 50)           650         dense_33[0][0]                   
__________________________________________________________________________________________________
dense_36 (Dense)                (None, 50)           650         dense_35[0][0]                   
__________________________________________________________________________________________________
dense_38 (Dense)                (None, 50)           650         dense_37[0][0]                   
__________________________________________________________________________________________________
dense_40 (Dense)                (None, 50)           650         dense_39[0][0]                   
__________________________________________________________________________________________________
dense_42 (Dense)                (None, 50)           650         dense_41[0][0]                   
__________________________________________________________________________________________________
dense_44 (Dense)                (None, 50)           650         dense_43[0][0]                   
__________________________________________________________________________________________________
dense_46 (Dense)                (None, 50)           650         dense_45[0][0]                   
__________________________________________________________________________________________________
dense_48 (Dense)                (None, 50)           650         dense_47[0][0]                   
__________________________________________________________________________________________________
multiply_17 (Multiply)          (None, 256, 256, 50) 0           lambda_17[0][0]                  
                                                                 dense_34[0][0]                   
__________________________________________________________________________________________________
multiply_18 (Multiply)          (None, 256, 256, 50) 0           lambda_18[0][0]                  
                                                                 dense_36[0][0]                   
__________________________________________________________________________________________________
multiply_19 (Multiply)          (None, 256, 256, 50) 0           lambda_19[0][0]                  
                                                                 dense_38[0][0]                   
__________________________________________________________________________________________________
multiply_20 (Multiply)          (None, 256, 256, 50) 0           lambda_20[0][0]                  
                                                                 dense_40[0][0]                   
__________________________________________________________________________________________________
multiply_21 (Multiply)          (None, 256, 256, 50) 0           lambda_21[0][0]                  
                                                                 dense_42[0][0]                   
__________________________________________________________________________________________________
multiply_22 (Multiply)          (None, 256, 256, 50) 0           lambda_22[0][0]                  
                                                                 dense_44[0][0]                   
__________________________________________________________________________________________________
multiply_23 (Multiply)          (None, 256, 256, 50) 0           lambda_23[0][0]                  
                                                                 dense_46[0][0]                   
__________________________________________________________________________________________________
multiply_24 (Multiply)          (None, 256, 256, 50) 0           lambda_24[0][0]                  
                                                                 dense_48[0][0]                   
__________________________________________________________________________________________________
reshape_17 (Reshape)            (None, 256, 256, 50, 0           multiply_17[0][0]                
__________________________________________________________________________________________________
reshape_18 (Reshape)            (None, 256, 256, 50, 0           multiply_18[0][0]                
__________________________________________________________________________________________________
reshape_19 (Reshape)            (None, 256, 256, 50, 0           multiply_19[0][0]                
__________________________________________________________________________________________________
reshape_20 (Reshape)            (None, 256, 256, 50, 0           multiply_20[0][0]                
__________________________________________________________________________________________________
reshape_21 (Reshape)            (None, 256, 256, 50, 0           multiply_21[0][0]                
__________________________________________________________________________________________________
reshape_22 (Reshape)            (None, 256, 256, 50, 0           multiply_22[0][0]                
__________________________________________________________________________________________________
reshape_23 (Reshape)            (None, 256, 256, 50, 0           multiply_23[0][0]                
__________________________________________________________________________________________________
reshape_24 (Reshape)            (None, 256, 256, 50, 0           multiply_24[0][0]                
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 256, 256, 50, 0           reshape_17[0][0]                 
                                                                 reshape_18[0][0]                 
                                                                 reshape_19[0][0]                 
                                                                 reshape_20[0][0]                 
                                                                 reshape_21[0][0]                 
                                                                 reshape_22[0][0]                 
                                                                 reshape_23[0][0]                 
                                                                 reshape_24[0][0]                 
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 256, 256, 50, 0           concatenate_3[0][0]              
                                                                 concatenate_4[0][0]              
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, 256, 256, 50, 12104       concatenate_5[0][0]              
__________________________________________________________________________________________________
lambda_25 (Lambda)              (None, 256, 256, 50) 0           conv3d_4[0][0]                   
__________________________________________________________________________________________________
lambda_26 (Lambda)              (None, 256, 256, 50) 0           conv3d_4[0][0]                   
__________________________________________________________________________________________________
lambda_27 (Lambda)              (None, 256, 256, 50) 0           conv3d_4[0][0]                   
__________________________________________________________________________________________________
lambda_28 (Lambda)              (None, 256, 256, 50) 0           conv3d_4[0][0]                   
__________________________________________________________________________________________________
lambda_29 (Lambda)              (None, 256, 256, 50) 0           conv3d_4[0][0]                   
__________________________________________________________________________________________________
lambda_30 (Lambda)              (None, 256, 256, 50) 0           conv3d_4[0][0]                   
__________________________________________________________________________________________________
lambda_31 (Lambda)              (None, 256, 256, 50) 0           conv3d_4[0][0]                   
__________________________________________________________________________________________________
lambda_32 (Lambda)              (None, 256, 256, 50) 0           conv3d_4[0][0]                   
__________________________________________________________________________________________________
global_average_pooling2d_25 (Gl (None, 50)           0           lambda_25[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_26 (Gl (None, 50)           0           lambda_26[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_27 (Gl (None, 50)           0           lambda_27[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_28 (Gl (None, 50)           0           lambda_28[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_29 (Gl (None, 50)           0           lambda_29[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_30 (Gl (None, 50)           0           lambda_30[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_31 (Gl (None, 50)           0           lambda_31[0][0]                  
__________________________________________________________________________________________________
global_average_pooling2d_32 (Gl (None, 50)           0           lambda_32[0][0]                  
__________________________________________________________________________________________________
dense_49 (Dense)                (None, 12)           612         global_average_pooling2d_25[0][0]
__________________________________________________________________________________________________
dense_51 (Dense)                (None, 12)           612         global_average_pooling2d_26[0][0]
__________________________________________________________________________________________________
dense_53 (Dense)                (None, 12)           612         global_average_pooling2d_27[0][0]
__________________________________________________________________________________________________
dense_55 (Dense)                (None, 12)           612         global_average_pooling2d_28[0][0]
__________________________________________________________________________________________________
dense_57 (Dense)                (None, 12)           612         global_average_pooling2d_29[0][0]
__________________________________________________________________________________________________
dense_59 (Dense)                (None, 12)           612         global_average_pooling2d_30[0][0]
__________________________________________________________________________________________________
dense_61 (Dense)                (None, 12)           612         global_average_pooling2d_31[0][0]
__________________________________________________________________________________________________
dense_63 (Dense)                (None, 12)           612         global_average_pooling2d_32[0][0]
__________________________________________________________________________________________________
dense_50 (Dense)                (None, 50)           650         dense_49[0][0]                   
__________________________________________________________________________________________________
dense_52 (Dense)                (None, 50)           650         dense_51[0][0]                   
__________________________________________________________________________________________________
dense_54 (Dense)                (None, 50)           650         dense_53[0][0]                   
__________________________________________________________________________________________________
dense_56 (Dense)                (None, 50)           650         dense_55[0][0]                   
__________________________________________________________________________________________________
dense_58 (Dense)                (None, 50)           650         dense_57[0][0]                   
__________________________________________________________________________________________________
dense_60 (Dense)                (None, 50)           650         dense_59[0][0]                   
__________________________________________________________________________________________________
dense_62 (Dense)                (None, 50)           650         dense_61[0][0]                   
__________________________________________________________________________________________________
dense_64 (Dense)                (None, 50)           650         dense_63[0][0]                   
__________________________________________________________________________________________________
multiply_25 (Multiply)          (None, 256, 256, 50) 0           lambda_25[0][0]                  
                                                                 dense_50[0][0]                   
__________________________________________________________________________________________________
multiply_26 (Multiply)          (None, 256, 256, 50) 0           lambda_26[0][0]                  
                                                                 dense_52[0][0]                   
__________________________________________________________________________________________________
multiply_27 (Multiply)          (None, 256, 256, 50) 0           lambda_27[0][0]                  
                                                                 dense_54[0][0]                   
__________________________________________________________________________________________________
multiply_28 (Multiply)          (None, 256, 256, 50) 0           lambda_28[0][0]                  
                                                                 dense_56[0][0]                   
__________________________________________________________________________________________________
multiply_29 (Multiply)          (None, 256, 256, 50) 0           lambda_29[0][0]                  
                                                                 dense_58[0][0]                   
__________________________________________________________________________________________________
multiply_30 (Multiply)          (None, 256, 256, 50) 0           lambda_30[0][0]                  
                                                                 dense_60[0][0]                   
__________________________________________________________________________________________________
multiply_31 (Multiply)          (None, 256, 256, 50) 0           lambda_31[0][0]                  
                                                                 dense_62[0][0]                   
__________________________________________________________________________________________________
multiply_32 (Multiply)          (None, 256, 256, 50) 0           lambda_32[0][0]                  
                                                                 dense_64[0][0]                   
__________________________________________________________________________________________________
reshape_25 (Reshape)            (None, 256, 256, 50, 0           multiply_25[0][0]                
__________________________________________________________________________________________________
reshape_26 (Reshape)            (None, 256, 256, 50, 0           multiply_26[0][0]                
__________________________________________________________________________________________________
reshape_27 (Reshape)            (None, 256, 256, 50, 0           multiply_27[0][0]                
__________________________________________________________________________________________________
reshape_28 (Reshape)            (None, 256, 256, 50, 0           multiply_28[0][0]                
__________________________________________________________________________________________________
reshape_29 (Reshape)            (None, 256, 256, 50, 0           multiply_29[0][0]                
__________________________________________________________________________________________________
reshape_30 (Reshape)            (None, 256, 256, 50, 0           multiply_30[0][0]                
__________________________________________________________________________________________________
reshape_31 (Reshape)            (None, 256, 256, 50, 0           multiply_31[0][0]                
__________________________________________________________________________________________________
reshape_32 (Reshape)            (None, 256, 256, 50, 0           multiply_32[0][0]                
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 256, 256, 50, 0           reshape_25[0][0]                 
                                                                 reshape_26[0][0]                 
                                                                 reshape_27[0][0]                 
                                                                 reshape_28[0][0]                 
                                                                 reshape_29[0][0]                 
                                                                 reshape_30[0][0]                 
                                                                 reshape_31[0][0]                 
                                                                 reshape_32[0][0]                 
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 256, 256, 50, 0           concatenate_5[0][0]              
                                                                 concatenate_6[0][0]              
__________________________________________________________________________________________________
average_pooling3d_1 (AveragePoo (None, 127, 127, 22, 0           concatenate_7[0][0]              
__________________________________________________________________________________________________
reshape_33 (Reshape)            (None, 127, 127, 704 0           average_pooling3d_1[0][0]        
__________________________________________________________________________________________________
separable_conv2d_1 (SeparableCo (None, 64, 64, 128)  96576       reshape_33[0][0]                 
__________________________________________________________________________________________________
separable_conv2d_2 (SeparableCo (None, 32, 32, 128)  17664       separable_conv2d_1[0][0]         
__________________________________________________________________________________________________
separable_conv2d_3 (SeparableCo (None, 16, 16, 128)  17664       separable_conv2d_2[0][0]         
__________________________________________________________________________________________________
separable_conv2d_4 (SeparableCo (None, 8, 8, 128)    17664       separable_conv2d_3[0][0]         
__________________________________________________________________________________________________
global_average_pooling2d_33 (Gl (None, 128)          0           separable_conv2d_4[0][0]         
__________________________________________________________________________________________________
dense_65 (Dense)                (None, 32)           4128        global_average_pooling2d_33[0][0]
__________________________________________________________________________________________________
dense_66 (Dense)                (None, 1)            33          dense_65[0][0]                   
==================================================================================================
Total params: 218,841
Trainable params: 218,841
Non-trainable params: 0
__________________________________________________________________________________________________
